Enterprise_Serivces/Prod/SilverGroup2/LoyaltyChannel/result1/Iteration1/t6_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/loyalty/contracts/2010/05/LoyaltyService/GetPointsHistory</wsa:Action><wsa:MessageID>uuid:eda72bdf-17bf-4ca2-8f4c-6792b14fb1d3</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://loyaltychannelqa1.testgs.pvt/LoyaltyService.svc</wsa:To></soap:Header><soap:Body><GetPointsHistory xmlns="http://www.gamestop.com/services/channel/loyalty/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/11">1276939253</CustomerID><NumberOfItemsPerPage xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/11">10</NumberOfItemsPerPage><PageNumber xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/11">1</PageNumber><StartDate xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/11">1999-05-31T13:20:00-05:00</StartDate></request></GetPointsHistory></soap:Body></soap:Envelope>